yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_contr_coment.c
/**
 * @file    gearbox_controller.c
 * @brief   Adaptive Robotized Manual Transmission Controller for STM32F103C8T6
 * @version 3.0
 * @author  (Your Name)
 * @date    2026
 * @license Open source for educational and competitive use
 *
 * @details
 * This firmware controls a robotized manual gearbox using two stepper motors
 * (X axis: shift row selection, Y axis: gear engagement) and a DC motor for
 * the clutch actuator. It reads vehicle data from a CAN bus (500 kbps),
 * implements automatic and manual shifting modes, provides comprehensive
 * safety features (current monitoring, emergency stop, limp mode),
 * redundant clutch position sensing (AS5600 magnetic encoder + backup
 * potentiometer), power saving sleep mode, and an interactive UART/Bluetooth
 * command interface.
 *
 * KEY FEATURES OF VERSION 3.0:
 * - Each drive mode (COMFORT, NORMAL, SPORT, WINTER) has its own shift map
 *   (upshift/downshift RPM thresholds) to suit different driving styles.
 * - Clutch engagement is always smooth: bite point is always used and the
 *   final creep to fully engaged position is done at a slow speed (20% PWM)
 *   to eliminate jerks. The aggressive "dump" mode has been removed.
 * - The incorrect RPM limit that previously blocked upshifts has been
 *   completely removed from is_shift_safe_winter().
 * - Automatic start: when in AUTO mode (≠ NORMAL) and the car is stationary
 *   with throttle > 3%, the controller automatically engages the appropriate
 *   starting gear (1st or 2nd for WINTER).
 * - Full documentation in Doxygen style.
 */
 
/* ==========================================================================
 * 1. INCLUDES
 * ========================================================================== */
#include "main.h"                // STM32 HAL generated file (includes chip definitions)
#include "stm32f1xx_hal.h"       // Hardware abstraction layer for STM32F1 family
#include <stdbool.h>             // Boolean type for cleaner logic
#include <stdio.h>               // For snprintf() – formatted string generation
#include <string.h>              // For memcpy(), memset(), strlen()
#include <stdlib.h>              // General utilities
#include <math.h>                // For floating-point operations (clutch bite calculation)

/* Optional SD card support – comment out if not used */
// #define USE_SD_CARD

#ifdef USE_SD_CARD
#include "ff.h"                  // FatFs file system library
#include "diskio.h"              // Low-level disk I/O for SD card
#endif

/* ==========================================================================
 * 2. CRITICAL FLASH MEMORY ADDRESSES (last 4 KB of 64 KB Flash)
 * ========================================================================== */
#define CALIB_FLASH_ADDR        0x0800FC00   // Calibration data (1 KB page)
#define CAN_PROFILE_FLASH_ADDR  0x0800F800   // CAN message profile (1 KB page)
#define ERROR_LOG_ADDR          0x0800F000   // Error log (4 KB page)

/* ==========================================================================
 * 3. SYSTEM CONSTANTS
 * ========================================================================== */
#define CALIB_MAGIC             0xA5C3F0F0   // Magic number to validate calibration data
#define ERROR_LOG_MAX_ENTRIES   50           // Maximum number of error records in RAM buffer
#define IDLE_TIMEOUT_MS         5000         // Milliseconds of inactivity before sleep
#define SENSOR_TOLERANCE        100          // Max allowed difference between AS5600 and backup
#define FILTER_ALPHA            0.2f         // Exponential smoothing factor for CAN data
#define MAX_CALIB_STEPS         5000         // Safety limit during limit switch search
#define BACKOFF_STEPS           50           // Steps to back off from endstop after hit
#define CLUTCH_TIMEOUT_MS       5000         // Max time allowed for clutch calibration
#define UART_MSG_BUF_SIZE       64           // Size of local string buffers

/* ==========================================================================
 * 4. DATA STRUCTURES (packed for Flash storage)
 * ========================================================================== */

/**
 * @brief Clutch calibration data (angles in AS5600 units, 0-4095)
 */
typedef struct {
    uint16_t angle_disengaged;   ///< Angle when clutch is fully pulled against endstop
    uint16_t angle_engaged;      ///< Angle when clutch is fully engaged (pedal pressed)
    uint16_t angle_bite_point;   ///< Calculated point where clutch starts to transmit torque
    uint8_t  calibrated;         ///< Flag: 1 if calibration was successful
} ClutchCalibration;

/**
 * @brief Single axis calibration (X = shift row, Y = gear engagement)
 */
typedef struct {
    int32_t left_limit;          ///< Absolute step count when left/front limit switch triggered
    int32_t right_limit;         ///< Absolute step count when right/back limit switch triggered
    int32_t home_offset;         ///< Step count corresponding to neutral position
    int32_t backlash;            ///< Measured mechanical play in steps
    uint8_t calibrated;          ///< Flag: 1 if axis calibration is valid
} AxisCalibration;

/**
 * @brief Complete calibration dataset stored in Flash.
 * __attribute__((packed)) ensures no padding bytes.
 */
typedef struct __attribute__((packed)) {
    uint32_t magic;              ///< Must equal CALIB_MAGIC
    uint16_t crc;                ///< CRC-16 of the entire structure (excluding this field)
    uint8_t  version;            ///< Version number (1)
    
    /* Clutch angles */
    uint16_t clutch_disengaged;
    uint16_t clutch_engaged;
    uint16_t clutch_bite;
    
    /* X axis (shift row) */
    int32_t  x_left_limit;
    int32_t  x_right_limit;
    int32_t  x_home;
    int32_t  x_backlash;
    
    /* Y axis (gear engagement) */
    int32_t  y_front_limit;
    int32_t  y_back_limit;
    int32_t  y_home;
    int32_t  y_backlash;
    
    /* Gear positions: 7 gears (0=Neutral, 1..5, 6=Reverse) each with X and Y steps */
    int32_t  gear_positions[7][2];
    
    uint8_t  calibrated;         ///< Global flag: 1 if all gears have been taught
} CalibrationData;

/**
 * @brief Backup clutch sensor (analog potentiometer) calibration.
 * Maps raw ADC values (0-4095) to AS5600 angle range using linear scale.
 */
typedef struct {
    uint16_t raw_min;            ///< ADC reading when clutch is fully disengaged
    uint16_t raw_max;            ///< ADC reading when clutch is fully engaged
    float scale;                 ///< Multiplier: (AS5600_range) / (backup_range)
    uint8_t calibrated;          ///< Flag: 1 if backup sensor is calibrated
} BackupSensorCalibration;

/**
 * @brief CAN message profile – describes where to find RPM, speed, throttle, brake.
 * Allows the controller to adapt to different vehicle CAN buses.
 */
typedef struct {
    uint16_t rpm_id;             ///< CAN ID containing engine RPM
    uint8_t rpm_offset;          ///< Byte offset within CAN data where RPM starts
    uint8_t rpm_length;          ///< Number of bytes (1 or 2)
    uint8_t rpm_factor;          ///< Multiplier to convert raw value to RPM (e.g., 4)
    uint8_t rpm_big_endian;      ///< 1 = big-endian (Motorola), 0 = little-endian (Intel)
    
    uint16_t speed_id;           ///< CAN ID for vehicle speed
    uint8_t speed_offset;
    uint8_t speed_length;
    uint8_t speed_factor;
    uint8_t speed_big_endian;
    
    uint16_t throttle_id;        ///< CAN ID for throttle pedal position (%)
    uint8_t throttle_offset;
    uint8_t throttle_length;
    uint8_t throttle_factor;
    
