yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_contr_coment.c
    uint16_t brake_id;           ///< CAN ID for brake pedal status (0/1)
    uint8_t brake_offset;
    uint8_t brake_bit;           ///< Which bit within the byte indicates brake pressed
    
    /* Extended fields for AWD wheel speed difference (optional) */
    uint16_t front_speed_id;
    uint8_t front_speed_offset;
    uint8_t front_speed_length;
    uint16_t rear_speed_id;
    uint8_t rear_speed_offset;
    uint8_t rear_speed_length;
} CanProfile;

/**
 * @brief Error log entry – stored in Flash for post‑mortem analysis.
 */
typedef struct {
    uint32_t timestamp;          ///< HAL_GetTick() value at error occurrence
    uint8_t  error_code;         ///< One of the ERR_* defines
    uint8_t  severity;           ///< 0=Info, 1=Warning, 2=Critical
    uint16_t data;               ///< Additional context (e.g., current value*10)
} ErrorLogEntry;

/**
 * @brief Shift map entry – defines RPM thresholds for a given throttle position.
 * Used in automatic mode. Each drive mode has its own table.
 */
typedef struct {
    uint8_t throttle;            ///< Throttle percentage (0-100)
    uint16_t upshift_rpm;        ///< If RPM exceeds this, request upshift
    uint16_t downshift_rpm;      ///< If RPM drops below this, request downshift
} ShiftMapEntry;

/**
 * @brief Drive mode parameters – adjust clutch speed, hold time, etc.
 */
typedef struct {
    uint8_t clutch_disengage_speed;   ///< PWM duty cycle (0-100) when disengaging clutch
    uint8_t clutch_engage_speed;      ///< PWM duty cycle when engaging clutch (to bite point)
    uint16_t clutch_hold_time_ms;     ///< Time clutch stays fully disengaged during shift
    uint16_t shift_delay_us;          ///< Delay between stepper motor steps (lower = faster)
    uint8_t use_bite_point;           ///< Always 1 in v3.0 (smooth engagement)
    uint8_t throttle_blip;            ///< Reserved for future automatic rev‑matching
    uint16_t max_rpm_shift;           ///< Not used for blocking shifts; kept for compatibility
    uint8_t start_from_second;        ///< 1 = start moving in 2nd gear (Winter mode)
} DriveParameters;

/**
 * @brief AWD (All‑Wheel Drive) configuration.
 */
typedef struct {
    uint8_t awd_enable_pin;           ///< GPIO pin number (e.g., GPIO_PIN_4 on PORTB)
    uint8_t awd_pwm_channel;          ///< Not used – reserved for future PWM control
    uint16_t awd_engage_delay_ms;     ///< Delay after toggling pin to allow mechanical coupling
    uint16_t awd_max_temp;            ///< Not implemented – placeholder for temperature monitoring
    uint8_t awd_auto_speed_diff;      ///< km/h difference to engage AUTO mode
    uint8_t awd_lock_timeout_s;       ///< Maximum seconds in LOCK mode before reverting to AUTO
} AwdConfig;

/* ==========================================================================
 * 5. ENUMERATIONS
 * ========================================================================== */

/** Calibration state machine states */
typedef enum {
    CAL_STATE_IDLE = 0,
    CAL_STATE_CLUTCH,
    CAL_STATE_AXIS_X,
    CAL_STATE_AXIS_Y,
    CAL_STATE_BACKLASH,
    CAL_STATE_GEAR_POSITIONS,
    CAL_STATE_SAVE,
    CAL_STATE_DONE,
    CAL_STATE_ERROR
} CalibrationState;

/** High‑level clutch actions */
typedef enum {
    CLUTCH_DISENGAGE,    ///< Pull clutch to endstop
    CLUTCH_ENGAGE,       ///< Release clutch smoothly (always uses bite point)
    CLUTCH_TO_BITE       ///< Move only to the bite point (for starting from standstill)
} ClutchAction;

/** Active clutch position sensor (redundancy) */
typedef enum {
    PRIMARY_AS5600,              ///< I2C magnetic encoder (default, high resolution)
    BACKUP_POTENTIOMETER,        ///< Analog potentiometer on ADC (fallback)
    SENSOR_FAULT                 ///< Both sensors invalid – triggers limp mode
} ActiveClutchSensor;

/** Driving modes – index into params_table[] and shift map tables */
typedef enum {
    DRIVE_MODE_COMFORT = 0,
    DRIVE_MODE_NORMAL = 1,
    DRIVE_MODE_SPORT = 2,
    DRIVE_MODE_WINTER = 3
} DriveMode;

/** AWD operational modes */
typedef enum {
    AWD_MODE_2WD = 0,
    AWD_MODE_AUTO = 1,
    AWD_MODE_LOCK = 2,
    AWD_MODE_LOW = 3
} AwdMode;

/* ==========================================================================
 * 6. ERROR CODES
 * ========================================================================== */
#define ERR_NONE                0
#define ERR_CURRENT_OVER_X      1
#define ERR_CURRENT_OVER_Y      2
#define ERR_CURRENT_OVER_CLUTCH 3
#define ERR_LIMIT_SWITCH_STUCK  4
#define ERR_STEPPER_STALL       5
#define ERR_CLUTCH_TIMEOUT      6
#define ERR_AS5600_MISSING      7
#define ERR_GEAR_NOT_FOUND      8
#define ERR_SHIFT_TIMEOUT       9
#define ERR_WATCHDOG_RESET      10
#define ERR_EMERGENCY_BUTTON    11

/* ==========================================================================
 * 7. GLOBAL VARIABLES (handles and volatile state)
 * ========================================================================== */

/* Peripheral handles */
I2C_HandleTypeDef hi2c1;
SPI_HandleTypeDef hspi2;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart3;
CAN_HandleTypeDef hcan1;
ADC_HandleTypeDef hadc1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim4;
IWDG_HandleTypeDef hiwdg;

/* Calibration data (RAM copies) */
CalibrationData cal_data = {0};
ClutchCalibration clutch_cal = {0};
AxisCalibration cal_X = {0};
AxisCalibration cal_Y = {0};
BackupSensorCalibration backup_cal = {0};
CanProfile current_profile = {0};

/* System state – volatile because accessed from interrupts */
volatile uint8_t current_gear = 0;                      // 0=N,1-5,6=R
volatile uint8_t current_shift_target_gear = 0;        // Temporary during shift
volatile uint8_t shifting_in_progress = 0;              // 1 = gear change ongoing
volatile DriveMode current_drive_mode = DRIVE_MODE_NORMAL;
volatile CalibrationState cal_state = CAL_STATE_IDLE;
volatile uint8_t calibration_started = 0;
volatile uint8_t calibration_running = 0;
volatile uint8_t calibration_error = 0;
volatile uint8_t calibration_success = 0;
volatile uint8_t cal_in_progress = 0;
volatile uint8_t abort_calibration = 0;
volatile uint8_t system_sleeping = 0;
volatile uint8_t limp_mode_active = 0;
volatile uint32_t can_loss_timer = 0;
volatile uint8_t is_parked = 0;
volatile uint32_t engine_off_timer = 0;
volatile bool as5600_comm_ok = false;

