yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_contr_coment.c
/* Stepper motor absolute step counters (updated on every step) */
int32_t current_x_steps = 0;
int32_t current_y_steps = 0;

/* CAN data – raw values updated in interrupt */
volatile uint16_t engine_rpm = 0;
volatile uint8_t vehicle_speed_kmh = 0;
volatile uint8_t throttle_percent = 0;
volatile uint8_t brake_pressed = 0;
volatile uint8_t shift_paddle_up = 0;
volatile uint8_t shift_paddle_down = 0;
uint8_t can_profile_valid = 0;

/* Filtered data (exponential moving average) */
uint16_t filtered_rpm = 0;
uint8_t filtered_throttle = 0;

/* Limit switch flags – set by EXTI interrupts (falling edge) */
volatile uint8_t limit_x_left_triggered = 0;   // PB2
volatile uint8_t limit_x_right_triggered = 0;  // PB3
volatile uint8_t limit_y_front_triggered = 0;  // PB10
volatile uint8_t limit_y_back_triggered = 0;   // PB11
volatile uint8_t clutch_endstop_triggered = 0; // PB1

/* Clutch sensor data */
uint16_t clutch_raw_angle = 0;
volatile uint16_t clutch_backup_sensor_raw = 0;
volatile ActiveClutchSensor active_sensor = PRIMARY_AS5600;
volatile uint8_t as5600_fault = 0;

/* Error logging circular buffer (RAM) */
ErrorLogEntry error_buffer[ERROR_LOG_MAX_ENTRIES];
uint8_t error_index = 0;
uint8_t error_count = 0;

/* Timers for non‑blocking operations */
volatile uint32_t last_activity_time = 0;
volatile uint32_t auto_calib_timer = 0;

/* AWD system */
volatile AwdMode current_awd_mode = AWD_MODE_2WD;
volatile uint8_t awd_engaged = 0;
volatile uint32_t awd_engagement_time = 0;
AwdConfig awd_config = {
    .awd_enable_pin = GPIO_PIN_4,
    .awd_pwm_channel = 0,
    .awd_engage_delay_ms = 200,
    .awd_max_temp = 0,
    .awd_auto_speed_diff = 10,
    .awd_lock_timeout_s = 30
};

volatile uint16_t front_wheel_speed_raw = 0;
volatile uint16_t rear_wheel_speed_raw = 0;

/* ========== SHIFT MAPS FOR EACH DRIVE MODE ========== */

/** COMFORT: early upshifts, very early downshifts – economical driving */
static const ShiftMapEntry shift_map_comfort[] = {
    {  0, 3500, 1200 },
    { 20, 3800, 1400 },
    { 40, 4200, 1600 },
    { 60, 4800, 2000 },
    { 80, 5200, 2400 },
    {100, 5800, 2800 }
};
#define SHIFT_MAP_SIZE_COMFORT (sizeof(shift_map_comfort)/sizeof(shift_map_comfort[0]))

/** NORMAL: balanced, original Ford MTX‑75 behaviour */
static const ShiftMapEntry shift_map_normal[] = {
    {  0, 4000, 1500 },
    { 20, 4500, 1800 },
    { 40, 5000, 2200 },
    { 60, 5500, 2800 },
    { 80, 6000, 3400 },
    {100, 6500, 4000 }
};
#define SHIFT_MAP_SIZE_NORMAL (sizeof(shift_map_normal)/sizeof(shift_map_normal[0]))

/** SPORT: late upshifts, aggressive downshifts – keeps engine in power band */
static const ShiftMapEntry shift_map_sport[] = {
    {  0, 4500, 2000 },
    { 20, 5000, 2200 },
    { 40, 5500, 2500 },
    { 60, 6000, 3000 },
    { 80, 6500, 3500 },
    {100, 7000, 4000 }
};
#define SHIFT_MAP_SIZE_SPORT (sizeof(shift_map_sport)/sizeof(shift_map_sport[0]))

/** WINTER: very early upshifts, low RPM limit, start from 2nd gear */
static const ShiftMapEntry shift_map_winter[] = {
    {  0, 1800, 1000 },
    { 20, 2000, 1100 },
    { 40, 2400, 1300 },
    { 60, 2800, 1500 },
    { 80, 3000, 1800 },
    {100, 3200, 2000 }
};
#define SHIFT_MAP_SIZE_WINTER (sizeof(shift_map_winter)/sizeof(shift_map_winter[0]))

/**
 * @brief Returns the shift map and its size for the current drive mode.
 * @param size Output pointer to store the number of entries in the map.
 * @return Pointer to the shift map array.
 */
static const ShiftMapEntry* get_shift_map(uint8_t* size) {
    switch (current_drive_mode) {
        case DRIVE_MODE_COMFORT:
            if (size) *size = SHIFT_MAP_SIZE_COMFORT;
            return shift_map_comfort;
        case DRIVE_MODE_SPORT:
            if (size) *size = SHIFT_MAP_SIZE_SPORT;
            return shift_map_sport;
        case DRIVE_MODE_WINTER:
            if (size) *size = SHIFT_MAP_SIZE_WINTER;
            return shift_map_winter;
        case DRIVE_MODE_NORMAL:
        default:
            if (size) *size = SHIFT_MAP_SIZE_NORMAL;
            return shift_map_normal;
    }
}

/* Drive parameters – use_bite_point is forced to 1 for smooth engagement (even in SPORT) */
const DriveParameters params_table[4] = {
    [DRIVE_MODE_COMFORT] = {60, 30, 200, 800, 1, 0, 7000, 0},
    [DRIVE_MODE_NORMAL]  = {80, 50, 120, 500, 1, 0, 7000, 0},
    [DRIVE_MODE_SPORT]   = {100,80, 50,  300, 1, 0, 7500, 0},   // use_bite_point forced to 1
    [DRIVE_MODE_WINTER]  = {70, 35, 300, 700, 1, 0, 6500, 1}
};

/* Known CAN profiles (Ford, VAG, Toyota, BMW) – for auto‑detection */
const CanProfile known_profiles[] = {
    {0x0C,0,2,4,1,  0x0D,0,1,1,1,  0x11,0,1,1,  0x1A,0,0,  0,0,0,  0,0,0},
    {0x280,2,2,4,1, 0x2A0,2,2,100,1, 0x2A0,0,1,1, 0x2A0,3,0, 0,0,0, 0,0,0},
    {0x2C0,0,2,4,1, 0x2C0,2,1,1,1,  0x2C0,3,1,1, 0x2C0,4,0, 0,0,0, 0,0,0},
    {0x0A0,0,2,4,1, 0x0A0,2,1,1,1,  0x0A0,3,1,1, 0x0A0,4,0, 0,0,0, 0,0,0}
};
#define NUM_PROFILES (sizeof(known_profiles)/sizeof(known_profiles[0]))

/* ADC zero‑current offsets for current sensors (calibrated at startup with motors disabled) */
int16_t current_offsets[3] = {0};   // [0]=X stepper, [1]=Y stepper, [2]=clutch motor

/* Bluetooth command buffer (USART3) */
#define BT_BUF_SIZE 32
char bt_buffer[BT_BUF_SIZE];
volatile uint8_t bt_index = 0, bt_cmd_ready = 0;

/* UART console command buffer (USART1) */
#define UART_BUF_SIZE 32
char uart_rx_buf[UART_BUF_SIZE];
volatile uint8_t uart_rx_index = 0, uart_cmd_ready = 0;

/* Human‑readable gear names */
const char* gear_names[] = { "N", "1", "2", "3", "4", "5", "R" };

/* Analog tachometer variables (TIM4 input capture) */
volatile uint16_t engine_rpm_analog = 0;
static volatile uint32_t tacho_period_us = 0;
static volatile uint32_t tacho_last_capture = 0;

/* ==========================================================================
 * 8. FUNCTION PROTOTYPES (hardware initialization)
 * ========================================================================== */
void SystemClock_Config(void);
void Error_Handler(void);
static void DWT_Init(void);
static void sleep_us(uint32_t us);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI2_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_CAN1_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM4_Init(void);
void IWDG_Init(void);
void IWDG_Refresh(void);

/* Stepper motor low‑level control */
void stepper_enable_x(void);
void stepper_disable_x(void);
void stepper_enable_y(void);
void stepper_disable_y(void);
void stepper_set_direction_x(uint8_t dir);
void stepper_set_direction_y(uint8_t dir);
void stepper_step_x(void);
void stepper_step_y(void);
void stepper_move_x(uint32_t steps, uint32_t delay_us);
void stepper_move_y(uint32_t steps, uint32_t delay_us);
void axis_move_relative(uint8_t axis, int32_t steps, uint32_t step_delay_us);

/* Clutch actuator and AS5600 sensor */
uint16_t AS5600_ReadAngle(void);
uint8_t AS5600_Init(void);
void clutch_set_direction(uint8_t dir);
void clutch_set_speed(uint8_t duty);
void clutch_stop(void);
uint8_t clutch_is_endstop_triggered(void);
uint16_t clutch_find_disengaged(void);
uint16_t clutch_find_bite_point(uint16_t dis, uint16_t eng);
uint8_t clutch_calibrate(void);
uint16_t clutch_get_disengaged_angle(void);
uint16_t clutch_get_engaged_angle(void);
uint16_t clutch_get_bite_point(void);
uint16_t clutch_get_current_angle(void);
void clutch_control_advanced(ClutchAction action);

/* Backup potentiometer (redundant sensor) */
void read_clutch_backup_sensor(void);
void calibrate_backup_sensor(uint16_t raw_dis, uint16_t raw_eng, uint16_t angle_dis, uint16_t angle_eng);
uint16_t backup_to_as5600_angle(uint16_t raw);
void check_sensor_consistency(void);

