yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_contr_coment.c
/* Axis calibration and Flash storage */
uint8_t axis_calibrate_x(void);
uint8_t axis_calibrate_y(void);
void run_full_calibration(void);
void learn_gear_positions(void);
uint8_t flash_save_calibration(CalibrationData* data);
uint8_t flash_load_calibration(CalibrationData* data);
static void flash_unlock(void);
static void flash_lock(void);
static void flash_erase_page(uint32_t addr);
static uint16_t calculate_crc16(uint8_t* data, uint32_t len);

/* Shifting algorithms */
uint8_t is_shift_safe_winter(uint8_t from, uint8_t to);
void move_to_neutral(void);
void move_to_gear_position_advanced(uint8_t gear, uint8_t axis);
uint8_t shift_gear_advanced(uint8_t target);
uint8_t shift_gear_limp_safe(uint8_t target);
uint16_t get_adaptive_downshift_hold_time(uint8_t from, uint8_t to);

/* CAN bus and automatic/manual shifting */
uint16_t get_rpm_universal(void);
uint8_t get_speed_universal(void);
void filter_data(void);
void auto_shift_task(void);
void manual_shift_task(void);
void toggle_drive_mode(void);
uint8_t auto_scan_can(void);
void save_can_profile(void);
void load_can_profile(void);
void apply_vehicle_adaptation(void);

/* Safety and monitoring */
void safety_init(void);
void emergency_power_off(void);
void emergency_power_on(void);
void emergency_stop(void);
void current_monitor_task(void);
uint8_t diagnostic_check(void);
void log_error(uint8_t code, uint8_t severity, uint16_t data);
void save_error_log_to_flash(void);
float get_current(uint8_t motor_idx);
void calibrate_current_offsets(void);
void check_critical_failures(void);
void enter_limp_mode(const char* reason);
void exit_limp_mode(void);

/* Power management */
void activity_reset_timer(void);
void idle_monitor_task(void);
void power_clutch_off(void);
void power_clutch_on(void);

/* Drive modes and parking */
DriveParameters get_current_drive_params(void);
void set_drive_mode(DriveMode mode);
void set_drive_mode_by_name(const char* mode_str);
uint8_t get_start_gear(void);
void start_moving(void);
void execute_parking_mode(void);
void exit_parking_mode(void);
void parking_monitor_task(void);

/* AWD */
void awd_init(void);
void awd_set_engaged(uint8_t engage);
uint8_t get_wheel_speed_diff(void);
void awd_auto_task(void);
void awd_set_mode(AwdMode mode);

/* Communication */
void uart_send_string(char* str);
void uart_clear_buffer(void);
void uart_command_handler(char* cmd);
void bt_send_string(char* str);
void send_status_via_bt(void);
void process_bt_command(void);

/* LED indication and main loop */
void led_set_pattern(uint8_t pattern);
void main_loop(void);

/* Interrupt callbacks (defined by HAL) */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin);
void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef* hcan);
void USART1_IRQHandler(void);
void USART3_IRQHandler(void);
void TIM4_IRQHandler(void);
void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef* htim);

/* ==========================================================================
 * 9. HARDWARE INITIALIZATION (complete implementations)
 * ========================================================================== */

/**
 * @brief System Clock Configuration – 72 MHz using external 8 MHz HSE.
 */
void SystemClock_Config(void) {
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
    
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;    // 8 MHz * 9 = 72 MHz
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) Error_Handler();
    
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                   RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK) Error_Handler();
}

/**
 * @brief Default error handler – flashes LED forever.
 */
void Error_Handler(void) {
    __disable_irq();
    while (1) {
        HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13);
        HAL_Delay(200);
    }
}

/**
 * @brief Initialize DWT cycle counter for microsecond delays.
 */
static void DWT_Init(void) {
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

/**
 * @brief Microsecond delay using DWT.
 * @param us microseconds (max ~1 second at 72 MHz)
 */
static void sleep_us(uint32_t us) {
    uint32_t start = DWT->CYCCNT;
    uint32_t cycles = us * (SystemCoreClock / 1000000);
    while ((DWT->CYCCNT - start) < cycles);
}

/**
 * @brief GPIO initialization – "Golden Pin Map"
 */
static void MX_GPIO_Init(void) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();
    
    /* Stepper motors */
    GPIO_InitStruct.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_3 | GPIO_PIN_4;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
    
    GPIO_InitStruct.Pin = GPIO_PIN_2 | GPIO_PIN_5;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2 | GPIO_PIN_5, GPIO_PIN_SET); // Start disabled
    
    /* Clutch H‑bridge direction pins */
    GPIO_InitStruct.Pin = GPIO_PIN_7;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
    GPIO_InitStruct.Pin = GPIO_PIN_0;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
    
    /* Limit switches and buttons (falling edge interrupts) */
    GPIO_InitStruct.Pin = GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 |
                          GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_8 | GPIO_PIN_9;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
    
