yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_contr_coment.c
void IWDG_Refresh(void) {
    HAL_IWDG_Refresh(&hiwdg);
}

/* ==========================================================================
 * 10. STEPPER AND CLUTCH LOW‑LEVEL CONTROL
 * ========================================================================== */

void stepper_enable_x(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_RESET); }
void stepper_disable_x(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); }
void stepper_set_direction_x(uint8_t dir) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, dir ? GPIO_PIN_SET : GPIO_PIN_RESET); }
void stepper_step_x(void) {
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET);
    sleep_us(5);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET);
    sleep_us(5);
}
void stepper_move_x(uint32_t steps, uint32_t delay_us) {
    if (steps == 0) return;
    stepper_enable_x();
    for (uint32_t i = 0; i < steps; i++) {
        stepper_step_x();
        current_x_steps += (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == GPIO_PIN_SET) ? 1 : -1;
        if (delay_us) sleep_us(delay_us);
        if ((i & 0xFF) == 0) IWDG_Refresh();
    }
}

void stepper_enable_y(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET); }
void stepper_disable_y(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET); }
void stepper_set_direction_y(uint8_t dir) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, dir ? GPIO_PIN_SET : GPIO_PIN_RESET); }
void stepper_step_y(void) {
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
    sleep_us(5);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_RESET);
    sleep_us(5);
}
void stepper_move_y(uint32_t steps, uint32_t delay_us) {
    if (steps == 0) return;
    stepper_enable_y();
    for (uint32_t i = 0; i < steps; i++) {
        stepper_step_y();
        current_y_steps += (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4) == GPIO_PIN_SET) ? 1 : -1;
        if (delay_us) sleep_us(delay_us);
        if ((i & 0xFF) == 0) IWDG_Refresh();
    }
}

void clutch_set_direction(uint8_t dir) {
    if (dir == 0) {  // Disengage – pull towards endstop
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_SET);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
    } else {         // Engage – push away from endstop
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
    }
}
void clutch_set_speed(uint8_t duty) {
    uint32_t pulse = (uint32_t)duty * 10;  // Duty 0-100 → pulse 0-1000 (Period=1000)
    if (pulse > 1000) pulse = 1000;
    __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, pulse);
}
void clutch_stop(void) {
    clutch_set_speed(0);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
}
uint8_t clutch_is_endstop_triggered(void) {
    return (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_1) == GPIO_PIN_RESET) ? 1 : 0;
}

uint8_t AS5600_Init(void) {
    uint8_t dummy = 0;
    return (HAL_I2C_Mem_Read(&hi2c1, 0x36 << 1, 0x0B, I2C_MEMADD_SIZE_8BIT, &dummy, 1, 100) == HAL_OK);
}
uint16_t AS5600_ReadAngle(void) {
    uint8_t buf[2];
    if (HAL_I2C_Mem_Read(&hi2c1, 0x36 << 1, 0x0C, I2C_MEMADD_SIZE_8BIT, buf, 2, 100) == HAL_OK) {
        as5600_comm_ok = true;
        clutch_raw_angle = ((uint16_t)buf[0] << 8) | buf[1];
        return clutch_raw_angle;
    }
    as5600_comm_ok = false;
    return 0xFFFF;
}

/* ==========================================================================
 * 11. CLUTCH CALIBRATION
 * ========================================================================== */
uint16_t clutch_find_disengaged(void) {
    clutch_set_direction(0);
    clutch_set_speed(30);
    uint32_t timeout = HAL_GetTick() + CLUTCH_TIMEOUT_MS;
    while (!clutch_is_endstop_triggered() && HAL_GetTick() < timeout) {
        HAL_Delay(10);
        IWDG_Refresh();
    }
    clutch_stop();
    return clutch_is_endstop_triggered() ? AS5600_ReadAngle() : 0;
}
uint16_t clutch_find_bite_point(uint16_t dis, uint16_t eng) {
    int32_t range = (int32_t)dis - (int32_t)eng;
    if (range < 0) range = -range;
    return (uint16_t)((float)eng + (float)range * 0.7f);
}
uint8_t clutch_calibrate(void) {
    if (!AS5600_Init()) return 0;
    uint16_t dis_angle = clutch_find_disengaged();
    if (dis_angle == 0) return 0;
    read_clutch_backup_sensor();
    uint16_t raw_dis = clutch_backup_sensor_raw;
    
    clutch_set_direction(1);
    clutch_set_speed(30);
    uint32_t timeout = HAL_GetTick() + 3000;
    uint16_t last = dis_angle, cur = dis_angle, eng = dis_angle;
    uint8_t stable = 0;
    while (HAL_GetTick() < timeout) {
        cur = AS5600_ReadAngle();
        int32_t diff = (int32_t)cur - (int32_t)last;
        if (diff < 0) diff = -diff;
        if (diff < 5) {
            if (++stable >= 5) { eng = cur; break; }
        } else stable = 0;
        last = cur;
        HAL_Delay(20);
        IWDG_Refresh();
    }
    clutch_stop();
    read_clutch_backup_sensor();
    uint16_t raw_eng = clutch_backup_sensor_raw;
    
    clutch_cal.angle_disengaged = dis_angle;
    clutch_cal.angle_engaged = eng;
    clutch_cal.angle_bite_point = clutch_find_bite_point(dis_angle, eng);
    clutch_cal.calibrated = 1;
    calibrate_backup_sensor(raw_dis, raw_eng, dis_angle, eng);
    return 1;
}
uint16_t clutch_get_disengaged_angle(void) { return clutch_cal.angle_disengaged; }
uint16_t clutch_get_engaged_angle(void) { return clutch_cal.angle_engaged; }
uint16_t clutch_get_bite_point(void) { return clutch_cal.angle_bite_point; }

/* ==========================================================================
 * 12. AXIS CALIBRATION AND BACKLASH
 * ========================================================================== */
static uint8_t axis_find_limit(uint8_t axis, uint8_t dir, uint32_t max_steps, uint32_t d_us, volatile uint8_t* flag) {
    uint32_t steps = 0;
    if (axis == 0) stepper_set_direction_x(dir); else stepper_set_direction_y(dir);
    while (*flag == 0 && steps < max_steps && abort_calibration == 0) {
        if (axis == 0) { stepper_step_x(); current_x_steps += (dir == 1) ? 1 : -1; }
        else { stepper_step_y(); current_y_steps += (dir == 1) ? 1 : -1; }
        steps++;
        if (d_us) sleep_us(d_us);
        if ((steps & 0xFF) == 0) IWDG_Refresh();
    }
    if (*flag == 1 && abort_calibration == 0) {
        uint8_t backoff = (dir == 1) ? 0 : 1;
        if (axis == 0) {
            stepper_set_direction_x(backoff);
            for (int i = 0; i < BACKOFF_STEPS; i++) { stepper_step_x(); current_x_steps += (backoff == 1) ? 1 : -1; sleep_us(d_us); }
        } else {
            stepper_set_direction_y(backoff);
            for (int i = 0; i < BACKOFF_STEPS; i++) { stepper_step_y(); current_y_steps += (backoff == 1) ? 1 : -1; sleep_us(d_us); }
        }
        return 1;
    }
    return 0;
}
static int32_t axis_measure_backlash(uint8_t axis, uint8_t ret_dir, uint32_t d_us) {
    uint32_t away = 200;
    uint8_t away_dir = (ret_dir == 1) ? 0 : 1;
    if (axis == 0) { stepper_set_direction_x(away_dir); for (uint32_t i = 0; i < away; i++) { stepper_step_x(); current_x_steps += (away_dir == 1) ? 1 : -1; sleep_us(d_us); } }
    else { stepper_set_direction_y(away_dir); for (uint32_t i = 0; i < away; i++) { stepper_step_y(); current_y_steps += (away_dir == 1) ? 1 : -1; sleep_us(d_us); } }
    if (axis == 0) { if (ret_dir == 0) limit_x_left_triggered = 0; else limit_x_right_triggered = 0; }
    else { if (ret_dir == 0) limit_y_front_triggered = 0; else limit_y_back_triggered = 0; }
    uint32_t back = 0;
    volatile uint8_t* flag = (axis == 0) ? ((ret_dir == 0) ? &limit_x_left_triggered : &limit_x_right_triggered) : ((ret_dir == 0) ? &limit_y_front_triggered : &limit_y_back_triggered);
    while (*flag == 0 && back < (away + 100) && abort_calibration == 0) {
        if (axis == 0) { stepper_set_direction_x(ret_dir); stepper_step_x(); current_x_steps += (ret_dir == 1) ? 1 : -1; }
        else { stepper_set_direction_y(ret_dir); stepper_step_y(); current_y_steps += (ret_dir == 1) ? 1 : -1; }
        back++; sleep_us(d_us);
    }
    if (*flag == 1) { int32_t bl = (int32_t)back - (int32_t)away; return (bl < 0) ? 0 : bl; }
    return 0;
}
uint8_t axis_calibrate_x(void) {
    if (cal_in_progress || abort_calibration) return 0;
    cal_in_progress = 1; limit_x_left_triggered = 0; limit_x_right_triggered = 0;
    if (!axis_find_limit(0, 0, MAX_CALIB_STEPS, 800, &limit_x_left_triggered)) { cal_in_progress = 0; return 0; }
    cal_X.left_limit = current_x_steps;
    if (!axis_find_limit(0, 1, MAX_CALIB_STEPS, 800, &limit_x_right_triggered)) { cal_in_progress = 0; return 0; }
    cal_X.right_limit = current_x_steps;
    int32_t total = cal_X.right_limit - cal_X.left_limit; if (total <= 0) { cal_in_progress = 0; return 0; }
    cal_X.home_offset = cal_X.left_limit + (total / 2);
    cal_X.backlash = axis_measure_backlash(0, 0, 1000);
    cal_X.calibrated = 1; cal_in_progress = 0; return 1;
}
uint8_t axis_calibrate_y(void) {
    if (cal_in_progress || abort_calibration) return 0;
    cal_in_progress = 1; limit_y_front_triggered = 0; limit_y_back_triggered = 0;
    if (!axis_find_limit(1, 0, MAX_CALIB_STEPS, 800, &limit_y_front_triggered)) { cal_in_progress = 0; return 0; }
    cal_Y.left_limit = current_y_steps;
    if (!axis_find_limit(1, 1, MAX_CALIB_STEPS, 800, &limit_y_back_triggered)) { cal_in_progress = 0; return 0; }
    cal_Y.right_limit = current_y_steps;
    int32_t total = cal_Y.right_limit - cal_Y.left_limit; if (total <= 0) { cal_in_progress = 0; return 0; }
    cal_Y.home_offset = cal_Y.left_limit + (total / 2);
    cal_Y.backlash = axis_measure_backlash(1, 0, 1000);
    cal_Y.calibrated = 1; cal_in_progress = 0; return 1;
}
void axis_move_relative(uint8_t axis, int32_t steps, uint32_t d_us) {
    if (steps == 0) return;
    uint8_t dir = (steps > 0) ? 1 : 0;
    uint32_t abs_steps = (steps > 0) ? steps : -steps;
    int32_t expected = (axis == 0) ? current_x_steps : current_y_steps;
    expected += (dir == 1) ? abs_steps : -abs_steps;
    if (axis == 0) {
        stepper_set_direction_x(dir); stepper_enable_x();
        for (uint32_t i = 0; i < abs_steps; i++) {
            if ((dir == 1 && limit_x_right_triggered) || (dir == 0 && limit_x_left_triggered)) { uart_send_string("X limit!\r\n"); break; }
            stepper_step_x(); current_x_steps += (dir == 1) ? 1 : -1;
            if (d_us) sleep_us(d_us);
            if ((i & 0xFF) == 0) IWDG_Refresh();
        }
    } else {
        stepper_set_direction_y(dir); stepper_enable_y();
        for (uint32_t i = 0; i < abs_steps; i++) {
            if ((dir == 1 && limit_y_back_triggered) || (dir == 0 && limit_y_front_triggered)) { uart_send_string("Y limit!\r\n"); break; }
            stepper_step_y(); current_y_steps += (dir == 1) ? 1 : -1;
            if (d_us) sleep_us(d_us);
            if ((i & 0xFF) == 0) IWDG_Refresh();
        }
    }
    int32_t actual = (axis == 0) ? current_x_steps : current_y_steps;
    if (actual != expected) {
        char m[80];
        snprintf(m, sizeof(m), "POS ERROR! Exp %ld got %ld\r\n", (long)expected, (long)actual);
        uart_send_string(m);
        log_error(ERR_STEPPER_STALL, 1, (uint16_t)(actual & 0xFFFF));
    }
}

