yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_contr_coment.c
/* ==========================================================================
 * 13. FLASH STORAGE AND CRC
 * ========================================================================== */
static uint16_t calculate_crc16(uint8_t* d, uint32_t len) {
    uint16_t crc = 0xFFFF;
    for (uint32_t i = 0; i < len; i++) {
        crc ^= (uint16_t)d[i];
        for (int j = 0; j < 8; j++) {
            if (crc & 1) crc = (crc >> 1) ^ 0xA001;
            else crc >>= 1;
        }
    }
    return crc;
}
static void flash_unlock(void) { HAL_FLASH_Unlock(); }
static void flash_lock(void) { HAL_FLASH_Lock(); }
static void flash_erase_page(uint32_t addr) {
    if (addr < 0x08000000 || addr > 0x0800FFFF) { uart_send_string("Flash addr out of range!\r\n"); return; }
    FLASH_EraseInitTypeDef e = {0}; uint32_t err;
    e.TypeErase = FLASH_TYPEERASE_PAGES; e.Banks = FLASH_BANK_1; e.PageAddress = addr; e.NbPages = 1;
    HAL_FLASHEx_Erase(&e, &err);
}
uint8_t flash_save_calibration(CalibrationData* data) {
    if ((uint32_t)data + sizeof(CalibrationData) > 0x08010000) return 0;
    uint32_t* src = (uint32_t*)data;
    uint32_t words = sizeof(CalibrationData) / 4;
    uint32_t addr = CALIB_FLASH_ADDR;
    flash_unlock(); flash_erase_page(CALIB_FLASH_ADDR);
    for (uint32_t i = 0; i < words; i++) {
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, src[i]) != HAL_OK) { flash_lock(); return 0; }
        addr += 4;
    }
    flash_lock(); return 1;
}
uint8_t flash_load_calibration(CalibrationData* data) {
    CalibrationData* flash = (CalibrationData*)CALIB_FLASH_ADDR;
    if (flash->magic != CALIB_MAGIC) return 0;
    memcpy(data, flash, sizeof(CalibrationData));
    uint16_t stored = data->crc; data->crc = 0;
    uint16_t calc = calculate_crc16((uint8_t*)data, sizeof(CalibrationData));
    data->crc = stored;
    return (stored == calc) && data->calibrated;
}

/* ==========================================================================
 * 14. LED PATTERNS AND FULL CALIBRATION MACHINE
 * ========================================================================== */
void led_set_pattern(uint8_t pat) {
    static uint32_t last = 0; static uint8_t cur = 0;
    uint32_t now = HAL_GetTick();
    if (pat == 0) { HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET); cur = 0; }
    else if (pat == 1) { HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET); cur = 1; }
    else {
        if (cur != pat) { cur = pat; last = now; HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET); }
        uint32_t iv = (pat == 2) ? 1000 : (pat == 3) ? 166 : 500; // slow, fast, heartbeat
        if ((now - last) >= iv) { last = now; HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13); }
    }
}
void run_full_calibration(void) {
    if (calibration_running) return;
    calibration_running = 1; calibration_error = 0; calibration_success = 0; abort_calibration = 0; cal_state = CAL_STATE_CLUTCH;
    while (cal_state != CAL_STATE_DONE && cal_state != CAL_STATE_ERROR && abort_calibration == 0) {
        IWDG_Refresh(); led_set_pattern(4);
        switch (cal_state) {
            case CAL_STATE_CLUTCH:
                if (clutch_calibrate()) {
                    cal_data.clutch_disengaged = clutch_get_disengaged_angle();
                    cal_data.clutch_engaged = clutch_get_engaged_angle();
                    cal_data.clutch_bite = clutch_get_bite_point();
                    cal_state = CAL_STATE_AXIS_X;
                } else cal_state = CAL_STATE_ERROR;
                break;
            case CAL_STATE_AXIS_X:
                if (axis_calibrate_x()) {
                    cal_data.x_left_limit = cal_X.left_limit;
                    cal_data.x_right_limit = cal_X.right_limit;
                    cal_data.x_home = cal_X.home_offset;
                    cal_data.x_backlash = cal_X.backlash;
                    cal_state = CAL_STATE_AXIS_Y;
                } else cal_state = CAL_STATE_ERROR;
                break;
            case CAL_STATE_AXIS_Y:
                if (axis_calibrate_y()) {
                    cal_data.y_front_limit = cal_Y.left_limit;
                    cal_data.y_back_limit = cal_Y.right_limit;
                    cal_data.y_home = cal_Y.home_offset;
                    cal_data.y_backlash = cal_Y.backlash;
                    cal_state = CAL_STATE_GEAR_POSITIONS;
                } else cal_state = CAL_STATE_ERROR;
                break;
            case CAL_STATE_GEAR_POSITIONS:
                for (int i = 0; i < 7; i++) { cal_data.gear_positions[i][0] = 0; cal_data.gear_positions[i][1] = 0; }
                cal_state = CAL_STATE_SAVE;
                break;
            case CAL_STATE_SAVE:
                cal_data.magic = CALIB_MAGIC; cal_data.version = 1; cal_data.calibrated = 0; cal_data.crc = 0;
                cal_data.crc = calculate_crc16((uint8_t*)&cal_data, sizeof(CalibrationData));
                if (flash_save_calibration(&cal_data)) { cal_state = CAL_STATE_DONE; calibration_success = 1; }
                else cal_state = CAL_STATE_ERROR;
                break;
            default: cal_state = CAL_STATE_ERROR; break;
        }
        HAL_Delay(100);
    }
    calibration_running = 0;
    if (cal_state == CAL_STATE_DONE) led_set_pattern(2);
    else { calibration_error = 1; led_set_pattern(3); stepper_disable_x(); stepper_disable_y(); clutch_stop(); }
}

/* ==========================================================================
 * 15. UART, GEAR LEARNING AND SHIFTING LOGIC
 * ========================================================================== */
void uart_send_string(char* s) { HAL_UART_Transmit(&huart1, (uint8_t*)s, strlen(s), HAL_MAX_DELAY); }
void uart_clear_buffer(void) { uart_rx_index = 0; uart_cmd_ready = 0; memset(uart_rx_buf, 0, UART_BUF_SIZE); }
void USART1_IRQHandler(void) {
    if (__HAL_UART_GET_FLAG(&huart1, UART_FLAG_RXNE)) {
        uint8_t ch = huart1.Instance->DR;
        if (ch == '\r' || ch == '\n') { if (uart_rx_index > 0) { uart_rx_buf[uart_rx_index] = '\0'; uart_cmd_ready = 1; } else uart_clear_buffer(); }
        else { if (uart_rx_index < UART_BUF_SIZE - 1) uart_rx_buf[uart_rx_index++] = (char)ch; else uart_clear_buffer(); }
        __HAL_UART_CLEAR_FLAG(&huart1, UART_FLAG_RXNE);
    }
}
static void wait_for_enter(const char* p) { uart_send_string((char*)p); uart_clear_buffer(); while (!uart_cmd_ready) { HAL_Delay(50); IWDG_Refresh(); } uart_clear_buffer(); }
static uint8_t learn_one_gear(uint8_t idx) {
    char buf[UART_MSG_BUF_SIZE];
    const char* name = (idx == 0) ? "Neutral (N)" : (idx == 6) ? "Reverse (R)" : gear_names[idx];
    snprintf(buf, sizeof(buf), "\r\n--- TEACHING GEAR: %s ---\r\n", name); uart_send_string(buf);
    wait_for_enter("1. Engine OFF, handbrake ON. Press Enter...");
    snprintf(buf, sizeof(buf), "2. Move lever into '%s'.\r\n", name); uart_send_string(buf);
    wait_for_enter("   Press Enter when lever is in position...");
    stepper_enable_x(); stepper_enable_y(); HAL_Delay(100);
    int32_t x = current_x_steps, y = current_y_steps;
    snprintf(buf, sizeof(buf), "   Recorded: X=%ld Y=%ld\r\n   Save? (y/n): ", x, y); uart_send_string(buf);
    uart_clear_buffer(); while (!uart_cmd_ready) { HAL_Delay(50); IWDG_Refresh(); }
    char resp = uart_rx_buf[0]; uart_clear_buffer();
    if (resp == 'y' || resp == 'Y') {
        cal_data.gear_positions[idx][0] = x; cal_data.gear_positions[idx][1] = y;
        uart_send_string("   [OK] Saved.\r\n"); return 1;
    } else {
        uart_send_string("   [CANCELLED] Retry.\r\n"); return 0;
    }
}
void learn_gear_positions(void) {
    uart_send_string("\r\n========================================\r\n  GEAR POSITION LEARNING MODE\r\n========================================\r\n");
    stepper_enable_x(); stepper_enable_y();
    for (uint8_t g = 0; g <= 6; g++) while (!learn_one_gear(g)) { uart_send_string("\r\n>>> Retrying...\r\n"); HAL_Delay(1000); }
    uart_send_string("\r\nSaving to Flash...\r\n");
    cal_data.magic = CALIB_MAGIC; cal_data.version = 1; cal_data.calibrated = 1; cal_data.crc = 0;
    cal_data.crc = calculate_crc16((uint8_t*)&cal_data, sizeof(CalibrationData));
    if (flash_save_calibration(&cal_data)) { uart_send_string("=== SUCCESS! All gears saved. ===\r\n"); led_set_pattern(2); }
    else { uart_send_string("=== ERROR! Flash write failed. ===\r\n"); led_set_pattern(3); }
    move_to_neutral();
}

/* ---- Shifting logic (advanced) with smooth clutch ---- */
uint16_t get_engine_rpm(void) { return get_rpm_universal(); }
uint8_t get_vehicle_speed(void) { return get_speed_universal(); }

