yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_contr_coment.c
/* is_shift_safe_winter – checks only reverse at speed and winter 1st gear (NO RPM limit) */
uint8_t is_shift_safe_winter(uint8_t from, uint8_t to) {
    uint8_t spd = get_vehicle_speed();
    if (to == 6 && spd > 5) { uart_send_string("Shift blocked: Reverse at speed\r\n"); return 0; }
    if (current_drive_mode == DRIVE_MODE_WINTER && to == 1 && spd > 10) {
        uart_send_string("Winter: 1st gear blocked >10km/h\r\n");
        return 0;
    }
    return 1;
}
uint16_t get_adaptive_downshift_hold_time(uint8_t from, uint8_t to) {
    DriveParameters p = get_current_drive_params();
    uint16_t base = p.clutch_hold_time_ms;
    if (from > to && to != 0) {
        if (filtered_rpm > 3000) return base + 150;
        else if (filtered_rpm > 2000) return base + 100;
        else return base + 50;
    }
    return base;
}
/**
 * @brief Advanced clutch control – always smooth.
 * For CLUTCH_ENGAGE, we always use the bite point and then creep slowly.
 */
void clutch_control_advanced(ClutchAction a) {
    DriveParameters p = get_current_drive_params();
    uint32_t start;
    uint16_t hold = get_adaptive_downshift_hold_time(current_gear, current_shift_target_gear);
    switch (a) {
        case CLUTCH_DISENGAGE:
            clutch_set_direction(0);
            clutch_set_speed(p.clutch_disengage_speed);
            start = HAL_GetTick();
            while (!clutch_is_endstop_triggered() && (HAL_GetTick() - start < 1000)) {
                HAL_Delay(5);
                IWDG_Refresh();
            }
            clutch_stop();
            for (uint16_t i = 0; i < hold; i += 50) { HAL_Delay(50); IWDG_Refresh(); }
            break;
        case CLUTCH_ENGAGE:
            // 1. Move to bite point at normal engage speed
            clutch_set_direction(1);
            clutch_set_speed(p.clutch_engage_speed);
            start = HAL_GetTick();
            while (clutch_get_current_angle() < cal_data.clutch_bite && (HAL_GetTick() - start < 1000)) {
                HAL_Delay(5);
                IWDG_Refresh();
            }
            clutch_stop();
            HAL_Delay(300);
            // 2. Slowly creep to fully engaged position – eliminates jerks
            clutch_set_direction(1);
            clutch_set_speed(20);
            start = HAL_GetTick();
            while (clutch_get_current_angle() < cal_data.clutch_engaged && (HAL_GetTick() - start < 1000)) {
                HAL_Delay(5);
                IWDG_Refresh();
            }
            clutch_stop();
            break;
        case CLUTCH_TO_BITE:
            clutch_set_direction(1);
            clutch_set_speed(20);
            while (clutch_get_current_angle() < cal_data.clutch_bite) {
                HAL_Delay(5);
                IWDG_Refresh();
            }
            clutch_stop();
            break;
    }
}
void move_to_gear_position_advanced(uint8_t gear, uint8_t axis) {
    DriveParameters p = get_current_drive_params();
    uint32_t d = p.shift_delay_us;
    int32_t target = (axis == 0) ? cal_data.gear_positions[gear][0] : cal_data.gear_positions[gear][1];
    if (target == 0 && gear != 0) { uart_send_string("ERROR: Gear not learned\r\n"); return; }
    int32_t cur = (axis == 0) ? current_x_steps : current_y_steps;
    int32_t bl = (axis == 0) ? cal_data.x_backlash : cal_data.y_backlash;
    int32_t diff = target - cur;
    if (diff == 0) return;
    uint8_t dir = (diff > 0) ? 1 : 0;
    int32_t abs_diff = (diff > 0) ? diff : -diff;
    if (axis == 0) {
        if (dir == 1) {
            if (cur > target) axis_move_relative(0, -(abs_diff + bl), d);
            axis_move_relative(0, abs_diff + bl, d);
        } else {
            if (cur < target) axis_move_relative(0, (abs_diff + bl), d);
            axis_move_relative(0, -(abs_diff + bl), d);
        }
    } else {
        if (dir == 1) {
            if (cur > target) axis_move_relative(1, -(abs_diff + bl), d);
            axis_move_relative(1, abs_diff + bl, d);
        } else {
            if (cur < target) axis_move_relative(1, (abs_diff + bl), d);
            axis_move_relative(1, -(abs_diff + bl), d);
        }
    }
}
void move_to_neutral(void) {
    move_to_gear_position_advanced(0, 1);
    HAL_Delay(30);
    move_to_gear_position_advanced(0, 0);
    HAL_Delay(30);
}
uint8_t shift_gear_advanced(uint8_t t) {
    if (shifting_in_progress) return 0;
    if (t == current_gear) return 1;
    if (!is_shift_safe_winter(current_gear, t)) return 0;
    shifting_in_progress = 1;
    current_shift_target_gear = t;
    activity_reset_timer();
    char msg[64];
    snprintf(msg, sizeof(msg), "Shifting to gear %d...\r\n", t);
    uart_send_string(msg);
    clutch_control_advanced(CLUTCH_DISENGAGE);
    if (current_gear != 0) {
        move_to_neutral();
        HAL_Delay(50);
    }
    if (t != 0) {
        move_to_gear_position_advanced(t, 0);
        HAL_Delay(40);
        move_to_gear_position_advanced(t, 1);
        HAL_Delay(80);
    }
    if (t == 0) {
        clutch_control_advanced(CLUTCH_ENGAGE);
    } else {
        if (current_gear == 0 && get_vehicle_speed() < 3) {
            clutch_control_advanced(CLUTCH_TO_BITE);
            HAL_Delay(400);
            clutch_control_advanced(CLUTCH_ENGAGE);
        } else {
            clutch_control_advanced(CLUTCH_ENGAGE);
        }
    }
    current_gear = t;
    shifting_in_progress = 0;
    current_shift_target_gear = 0;
    snprintf(msg, sizeof(msg), "Shift complete. Gear: %d\r\n", current_gear);
    uart_send_string(msg);
    return 1;
}
uint8_t shift_gear_limp_safe(uint8_t t) {
    if (!limp_mode_active) return shift_gear_advanced(t);
    if (t == 0 || t == 2 || t == current_gear) {
        uart_send_string("[LIMP] Allowed shift.\r\n");
        return shift_gear_advanced(t);
    }
    char msg[128];
    snprintf(msg, sizeof(msg), "LIMP: Shift to %d BLOCKED. Use N or 2nd.\r\n", t);
    uart_send_string(msg);
    bt_send_string(msg);
    return 0;
}

