yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_contr_coment.c
/* ==========================================================================
 * 16. CURRENT MONITORING AND SAFETY (partial – key functions shown)
 * ========================================================================== */
static uint16_t read_adc_channel(uint32_t ch) {
    ADC_ChannelConfTypeDef c = {0}; c.Channel = ch; c.Rank = 1; c.SamplingTime = ADC_SAMPLETIME_13CYCLES_5;
    HAL_ADC_ConfigChannel(&hadc1, &c); HAL_ADC_Start(&hadc1); HAL_ADC_PollForConversion(&hadc1, 10);
    uint16_t val = HAL_ADC_GetValue(&hadc1); HAL_ADC_Stop(&hadc1); return val;
}
void calibrate_current_offsets(void) {
    uint32_t sx = 0, sy = 0, sc = 0;
    for (int i = 0; i < 16; i++) { sx += read_adc_channel(ADC_CHANNEL_10); sy += read_adc_channel(ADC_CHANNEL_11); sc += read_adc_channel(ADC_CHANNEL_12); HAL_Delay(2); }
    current_offsets[0] = sx / 16; current_offsets[1] = sy / 16; current_offsets[2] = sc / 16;
}
float get_current(uint8_t idx) {
    if (idx > 2) return 0.0f;
    uint32_t ch[] = { ADC_CHANNEL_10,ADC_CHANNEL_11,ADC_CHANNEL_12 };
    uint16_t raw = read_adc_channel(ch[idx]); int16_t diff = (int16_t)raw - current_offsets[idx];
    float volts = diff * (3.3f / 4096.0f); float amps = volts / 0.185f;
    return (amps > 0) ? amps : -amps;
}
void current_monitor_task(void) {
    static uint32_t last = 0; if (HAL_GetTick() - last < 100) return; last = HAL_GetTick();
    float ix = get_current(0), iy = get_current(1), ic = get_current(2);
    if (ix > 4.5f && !shifting_in_progress && !calibration_running) { log_error(ERR_CURRENT_OVER_X, 1, (uint16_t)(ix * 10)); stepper_disable_x(); }
    if (iy > 4.5f && !shifting_in_progress && !calibration_running) { log_error(ERR_CURRENT_OVER_Y, 1, (uint16_t)(iy * 10)); stepper_disable_y(); }
    if (ic > 10.0f) { log_error(ERR_CURRENT_OVER_CLUTCH, 2, (uint16_t)(ic * 10)); emergency_power_off(); }
}
void emergency_power_off(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_RESET); uart_send_string("EMERGENCY POWER OFF\r\n"); }
void emergency_power_on(void) { HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_SET); }
void emergency_stop(void) { log_error(ERR_EMERGENCY_BUTTON, 2, 0); emergency_power_off(); shifting_in_progress = 0; calibration_running = 0; limp_mode_active = 1; clutch_stop(); stepper_disable_x(); stepper_disable_y(); }
void log_error(uint8_t code, uint8_t sev, uint16_t data) {
    error_buffer[error_index].timestamp = HAL_GetTick(); error_buffer[error_index].error_code = code; error_buffer[error_index].severity = sev; error_buffer[error_index].data = data;
    error_index = (error_index + 1) % ERROR_LOG_MAX_ENTRIES; if (error_count < ERROR_LOG_MAX_ENTRIES) error_count++;
    if (sev == 2) { limp_mode_active = 1; emergency_power_off(); shifting_in_progress = 0; calibration_running = 0; clutch_stop(); stepper_disable_x(); stepper_disable_y(); led_set_pattern(3); bt_send_string("CRITICAL FAULT! Limp mode.\r\n"); }
}
uint8_t diagnostic_check(void) {
    uint8_t ok = 1; if (!AS5600_Init()) { log_error(ERR_AS5600_MISSING, 2, 0); ok = 0; }
    if (limit_x_left_triggered && limit_x_right_triggered) { log_error(ERR_LIMIT_SWITCH_STUCK, 1, 0); ok = 0; }
    if (limit_y_front_triggered && limit_y_back_triggered) { log_error(ERR_LIMIT_SWITCH_STUCK, 1, 1); ok = 0; }
    return ok;
}
void HAL_GPIO_EXTI_Callback(uint16_t pin) {
    switch (pin) {
        case GPIO_PIN_1: clutch_endstop_triggered = 1; break;
        case GPIO_PIN_2: limit_x_left_triggered = 1; break;
        case GPIO_PIN_3: limit_x_right_triggered = 1; break;
        case GPIO_PIN_10: limit_y_front_triggered = 1; break;
        case GPIO_PIN_11: limit_y_back_triggered = 1; break;
        case GPIO_PIN_8: emergency_stop(); break;
        default: break;
    }
}
void safety_init(void) {
    GPIO_InitTypeDef g = {0}; __HAL_RCC_GPIOA_CLK_ENABLE(); g.Pin = GPIO_PIN_8; g.Mode = GPIO_MODE_OUTPUT_PP; g.Speed = GPIO_SPEED_FREQ_LOW; HAL_GPIO_Init(GPIOA, &g);
    emergency_power_on(); stepper_disable_x(); stepper_disable_y(); clutch_stop(); calibrate_current_offsets(); diagnostic_check();
}

/* ==========================================================================
 * 17. CAN, AUTO/MANUAL SHIFTING, BLUETOOTH, UART COMMANDS
 * ========================================================================== */
void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef* hcan) {
    CAN_RxHeaderTypeDef hdr; uint8_t data[8];
    if (HAL_CAN_GetRxMessage(hcan, CAN_RX_FIFO0, &hdr, data) == HAL_OK) {
        switch (hdr.StdId) {
            case 0x0C: engine_rpm = ((uint16_t)data[0] << 8) | data[1]; break;
            case 0x0D: vehicle_speed_kmh = data[0]; break;
            case 0x11: throttle_percent = data[0]; break;
            case 0x1A: brake_pressed = (data[0] > 0) ? 1 : 0; break;
            case 0x30: shift_paddle_up = (data[0] & 0x01); shift_paddle_down = (data[0] & 0x02); break;
            default: break;
        }
        if (current_profile.front_speed_id && hdr.StdId == current_profile.front_speed_id) {
            uint16_t val = 0; for (int i = 0; i < current_profile.front_speed_length; i++) val |= (data[current_profile.front_speed_offset + i] << (8 * i));
            front_wheel_speed_raw = val;
        }
        if (current_profile.rear_speed_id && hdr.StdId == current_profile.rear_speed_id) {
            uint16_t val = 0; for (int i = 0; i < current_profile.rear_speed_length; i++) val |= (data[current_profile.rear_speed_offset + i] << (8 * i));
            rear_wheel_speed_raw = val;
        }
    }
}
void filter_data(void) { filtered_rpm = (uint16_t)((1.0f - FILTER_ALPHA) * filtered_rpm + FILTER_ALPHA * engine_rpm); filtered_throttle = (uint8_t)((1.0f - FILTER_ALPHA) * filtered_throttle + FILTER_ALPHA * throttle_percent); }
/**
 * @brief Automatic shifting task – uses drive mode specific shift map.
 */
void auto_shift_task(void) {
    if (limp_mode_active || shifting_in_progress || current_gear == 0 || current_gear == 6) return;
    static uint32_t last = 0;
    uint32_t now = HAL_GetTick();
    if (now - last < 800) return;
    uint8_t map_size;
    const ShiftMapEntry* map = get_shift_map(&map_size);
    const ShiftMapEntry* e = &map[map_size - 1];
    for (uint8_t i = 0; i < map_size; i++) {
        if (filtered_throttle <= map[i].throttle) { e = &map[i]; break; }
    }
    if (filtered_rpm > e->upshift_rpm && current_gear < 5) {
        char msg[64];
        snprintf(msg, sizeof(msg), "[AUTO] UP: f_rpm=%d > %d thr=%d%% mode=%d\r\n",
                 filtered_rpm, e->upshift_rpm, filtered_throttle, current_drive_mode);
        uart_send_string(msg);
        shift_gear_limp_safe(current_gear + 1);
        last = now;
    } else if (filtered_rpm < e->downshift_rpm && current_gear > 1) {
        char msg[64];
        snprintf(msg, sizeof(msg), "[AUTO] DN: f_rpm=%d < %d thr=%d%% mode=%d\r\n",
                 filtered_rpm, e->downshift_rpm, filtered_throttle, current_drive_mode);
        uart_send_string(msg);
        shift_gear_limp_safe(current_gear - 1);
        last = now;
    }
    if (brake_pressed && filtered_rpm < 2000 && current_gear > 1 && (now - last) > 500) {
        shift_gear_limp_safe(current_gear - 1);
        last = now;
    }
}
void manual_shift_task(void) {
    static uint32_t last = 0; uint32_t now = HAL_GetTick();
    if (now - last < 150) return;
    if (shift_paddle_up) { if (current_gear < 5) shift_gear_limp_safe(current_gear + 1); last = now; shift_paddle_up = 0; }
    else if (shift_paddle_down) { if (current_gear > 1) shift_gear_limp_safe(current_gear - 1); last = now; shift_paddle_down = 0; }
}
void toggle_drive_mode(void) {
    if (current_drive_mode == DRIVE_MODE_NORMAL) { current_drive_mode = DRIVE_MODE_COMFORT; uart_send_string(">>> AUTO (Comfort) <<<\r\n"); led_set_pattern(2); }
    else { current_drive_mode = DRIVE_MODE_NORMAL; uart_send_string(">>> MANUAL (Normal) <<<\r\n"); led_set_pattern(0); }
    activity_reset_timer();
}
void set_drive_mode_by_name(const char* s) {
    if (strcmp(s, "auto") == 0 || strcmp(s, "1") == 0) { current_drive_mode = DRIVE_MODE_COMFORT; uart_send_string(">>> AUTO (Comfort) ENABLED <<<\r\n"); led_set_pattern(2); }
    else if (strcmp(s, "manual") == 0 || strcmp(s, "0") == 0) { current_drive_mode = DRIVE_MODE_NORMAL; uart_send_string(">>> MANUAL (Normal) ENABLED <<<\r\n"); led_set_pattern(0); }
    else uart_send_string("Invalid mode. Use 'auto' or 'manual'.\r\n");
    activity_reset_timer();
}
void bt_send_string(char* s) { HAL_UART_Transmit(&huart3, (uint8_t*)s, strlen(s), HAL_MAX_DELAY); }
void send_status_via_bt(void) {
    char b[UART_MSG_BUF_SIZE];
    const char* g = (current_gear == 0) ? "N" : (current_gear == 6) ? "R" : gear_names[current_gear];
    const char* m = (current_drive_mode != DRIVE_MODE_NORMAL) ? "AUTO" : "MANUAL";
    snprintf(b, sizeof(b), "Gear:%s RPM:%d Spd:%d Throt:%d%% Mode:%s Limp:%s\r\n",
             g, filtered_rpm, get_speed_universal(), filtered_throttle, m,
             limp_mode_active ? "ON" : "OFF");
    bt_send_string(b);
}
void USART3_IRQHandler(void) {
    if (__HAL_UART_GET_FLAG(&huart3, UART_FLAG_RXNE)) {
        uint8_t ch = huart3.Instance->DR;
        if (ch == '\r' || ch == '\n') { if (bt_index > 0) { bt_buffer[bt_index] = '\0'; bt_cmd_ready = 1; } bt_index = 0; }
        else { if (bt_index < BT_BUF_SIZE - 1) bt_buffer[bt_index++] = (char)ch; else bt_index = 0; }
        __HAL_UART_CLEAR_FLAG(&huart3, UART_FLAG_RXNE);
    }
}
void process_bt_command(void) {
    if (!bt_cmd_ready) return; activity_reset_timer();
    char c = bt_buffer[0]; uint8_t can = cal_data.calibrated && !shifting_in_progress && !calibration_running;
    switch (c) {
        case '1': case '2': case '3': case '4': case '5': if (can) shift_gear_limp_safe(c - '0'); else bt_send_string("Shift blocked\r\n"); break;
        case 'N': case 'n': if (can) shift_gear_limp_safe(0); else bt_send_string("Shift blocked\r\n"); break;
        case 'R': case 'r': if (can) shift_gear_limp_safe(6); else bt_send_string("Shift blocked\r\n"); break;
        case 'A': case 'a': current_drive_mode = DRIVE_MODE_COMFORT; bt_send_string("Mode: AUTO\r\n"); led_set_pattern(2); break;
        case 'M': case 'm': current_drive_mode = DRIVE_MODE_NORMAL; bt_send_string("Mode: MANUAL\r\n"); led_set_pattern(0); break;
        case 'S': case 's': send_status_via_bt(); break;
        default: bt_send_string("Cmds: 1-5,N,R,A,M,S\r\n"); break;
    }
    bt_index = 0; bt_cmd_ready = 0; memset(bt_buffer, 0, BT_BUF_SIZE);
}
void uart_command_handler(char* cmd) {
    activity_reset_timer();
    if (strcmp(cmd, "help") == 0) {
        uart_send_string("\r\n=== COMMANDS ===\r\nstatus calibrate learn_gears mode auto/manual gear N/1-5/R\ncan_scan can_status fault can clear fault save reset sensor_status\n");
#ifdef USE_SD_CARD
        uart_send_string("sd_save sd_load\n");
#endif
        uart_send_string("================\r\n");
    }
    else if (strcmp(cmd, "status") == 0) {
        char b[UART_MSG_BUF_SIZE];
        uart_send_string("\r\n--- STATUS ---\r\n");
        snprintf(b, sizeof(b), "Mode:%s Gear:%s\r\n", (current_drive_mode != DRIVE_MODE_NORMAL) ? "AUTO" : "MANUAL", (current_gear == 0) ? "N" : (current_gear == 6) ? "R" : gear_names[current_gear]); uart_send_string(b);
        snprintf(b, sizeof(b), "RPM:%d Speed:%d Throttle:%d%%\r\n", filtered_rpm, get_speed_universal(), filtered_throttle); uart_send_string(b);
        snprintf(b, sizeof(b), "Clutch angle:%d (dis:%d bite:%d eng:%d)\r\n", clutch_get_current_angle(), cal_data.clutch_disengaged, cal_data.clutch_bite, cal_data.clutch_engaged); uart_send_string(b);
        snprintf(b, sizeof(b), "Sensor:%s Backup raw:%d\r\n", (active_sensor == PRIMARY_AS5600) ? "AS5600" : "POT", clutch_backup_sensor_raw); uart_send_string(b);
        snprintf(b, sizeof(b), "Calibrated:%s Limp:%s Sleep:%s\r\n", cal_data.calibrated ? "YES" : "NO", limp_mode_active ? "ACTIVE" : "OFF", system_sleeping ? "YES" : "NO"); uart_send_string(b);
    }
    else if (strcmp(cmd, "calibrate") == 0) { if (calibration_running || shifting_in_progress) uart_send_string("Busy!\r\n"); else { uart_send_string("Starting calibration...\r\n"); run_full_calibration(); } }
    else if (strcmp(cmd, "learn_gears") == 0) { if (calibration_running || shifting_in_progress || !cal_data.calibrated) uart_send_string("Complete basic calibration first!\r\n"); else learn_gear_positions(); }
    else if (strncmp(cmd, "mode ", 5) == 0) set_drive_mode_by_name(cmd + 5);
    else if (strncmp(cmd, "gear ", 5) == 0) {
        if (calibration_running || !cal_data.calibrated) { uart_send_string("Not calibrated!\r\n"); return; }
        char gc = cmd[5]; uint8_t t = 0;
        if (gc == 'N' || gc == 'n' || gc == '0') t = 0; else if (gc >= '1' && gc <= '5') t = gc - '0'; else if (gc == 'R' || gc == 'r' || gc == '6') t = 6; else { uart_send_string("Invalid gear\r\n"); return; }
        if (!shift_gear_limp_safe(t)) uart_send_string("Shift blocked\r\n");
    }
    else if (strcmp(cmd, "can_scan") == 0) { can_profile_valid = 0; if (auto_scan_can()) apply_vehicle_adaptation(); }
    else if (strcmp(cmd, "can_status") == 0) { char b[UART_MSG_BUF_SIZE]; snprintf(b, sizeof(b), "CAN valid:%s RPM_ID:0x%X SPD_ID:0x%X\r\n", can_profile_valid ? "YES" : "NO", current_profile.rpm_id, current_profile.speed_id); uart_send_string(b); }
    else if (strcmp(cmd, "fault can") == 0) enter_limp_mode("SIMULATED CAN LOSS");
    else if (strcmp(cmd, "clear fault") == 0) exit_limp_mode();
    else if (strcmp(cmd, "save") == 0) { cal_data.crc = 0; cal_data.crc = calculate_crc16((uint8_t*)&cal_data, sizeof(CalibrationData)); if (flash_save_calibration(&cal_data)) uart_send_string("Saved to Flash.\r\n"); else uart_send_string("Flash write failed.\r\n"); }
#ifdef USE_SD_CARD
    else if (strcmp(cmd, "sd_save") == 0) { if (sd_save_calibration(&cal_data)) uart_send_string("Saved to SD.\r\n"); else uart_send_string("SD write failed.\r\n"); }
    else if (strcmp(cmd, "sd_load") == 0) { if (sd_load_calibration(&cal_data)) uart_send_string("Loaded from SD.\r\n"); else uart_send_string("SD load failed.\r\n"); }
#endif
    else if (strcmp(cmd, "sensor_status") == 0) { char b[UART_MSG_BUF_SIZE]; snprintf(b, sizeof(b), "Active:%s AS5600:%d Backup raw:%d Mapped:%d\r\n", (active_sensor == PRIMARY_AS5600) ? "AS5600" : "POT", AS5600_ReadAngle(), clutch_backup_sensor_raw, backup_to_as5600_angle(clutch_backup_sensor_raw)); uart_send_string(b); }
    else if (strcmp(cmd, "reset") == 0) { uart_send_string("Resetting...\r\n"); HAL_Delay(500); NVIC_SystemReset(); }
    else uart_send_string("Unknown. Type 'help'.\r\n");
}

