yuschenko-mehan/robotized-gearbox-controller-for-STM32/gearbox_contr_coment.c
/* ==========================================================================
 * 20. ANALOG TACHOMETER (TIM4 input capture)
 * ========================================================================== */
void TIM4_IRQHandler(void) { HAL_TIM_IRQHandler(&htim4); }
void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef* htim) {
    if (htim->Instance == TIM4) {
        uint32_t now = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_1);
        if (tacho_last_capture != 0) {
            uint32_t diff = now - tacho_last_capture;
            if (now < tacho_last_capture) diff = (0xFFFF - tacho_last_capture) + now;
            if (diff < 60000) tacho_period_us = diff;
        }
        tacho_last_capture = now;
    }
}
void read_analog_tacho(void) {
#define TACHO_PULSES_PER_REV 2
    if (tacho_period_us > 0) { float freq = 1000000.0f / (float)tacho_period_us; engine_rpm_analog = (uint16_t)((freq / TACHO_PULSES_PER_REV) * 60.0f + 0.5f); }
    else engine_rpm_analog = 0;
}

/* ==========================================================================
 * 21. MAIN LOOP AND POWER MANAGEMENT
 * ========================================================================== */
void main_loop(void) {
    static uint32_t t100 = 0, t500 = 0, t1000 = 0;
    uint32_t now = HAL_GetTick();
    if (now - t100 >= 100) {
        t100 = now;
        filter_data();
        current_monitor_task();
        check_critical_failures();
        parking_monitor_task();
        awd_auto_task();
        if (cal_data.calibrated && !calibration_running) {
            if (current_drive_mode != DRIVE_MODE_NORMAL) auto_shift_task();
            else manual_shift_task();
        }
        process_bt_command();
    }
    if (now - t500 >= 500) {
        t500 = now;
        IWDG_Refresh();
        if (cal_data.calibrated && !calibration_running) {
            diagnostic_check();
            read_clutch_backup_sensor();
            check_sensor_consistency();
        }
    }
    if (now - t1000 >= 1000) {
        t1000 = now;
        idle_monitor_task();
        if (!calibration_running && !shifting_in_progress) {
            if (!cal_data.calibrated) led_set_pattern(1);
            else if (system_sleeping) led_set_pattern(4);
            else if (current_drive_mode != DRIVE_MODE_NORMAL) led_set_pattern(2);
            else led_set_pattern(0);
        }
    }
    if (uart_cmd_ready) { uart_command_handler(uart_rx_buf); uart_clear_buffer(); }
}

/* ==========================================================================
 * 22. MAIN FUNCTION
 * ========================================================================== */
int main(void) {
    HAL_Init();
    SystemClock_Config();
    MX_GPIO_Init();
    MX_I2C1_Init();
    MX_SPI2_Init();
    MX_USART1_UART_Init();
    MX_USART3_UART_Init();
    MX_CAN1_Init();
    MX_ADC1_Init();
    MX_TIM2_Init();
    MX_TIM4_Init();
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
    DWT_Init();
    safety_init();
    for (int i = 0; i < 3; i++) { HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET); HAL_Delay(100); HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET); HAL_Delay(100); }
    uart_send_string("\r\n=== ROBOTIZED GEARBOX v3.0 (Multi-map + smooth clutch) ===\r\n");
    load_can_profile();
    apply_vehicle_adaptation();
    if (flash_load_calibration(&cal_data)) {
        uart_send_string("Calibration loaded.\r\n");
        led_set_pattern(cal_data.calibrated ? (current_drive_mode != DRIVE_MODE_NORMAL ? 2 : 0) : 1);
    } else {
        uart_send_string("No calibration. Auto-cal in 5 sec...\r\n");
        auto_calib_timer = HAL_GetTick() + 5000;
    }
    while (1) {
        if (auto_calib_timer && HAL_GetTick() >= auto_calib_timer) {
            if (!uart_cmd_ready) { auto_calib_timer = 0; run_full_calibration(); }
            else { uart_send_string("Auto-cal cancelled.\r\n"); auto_calib_timer = 0; uart_clear_buffer(); }
        }
        main_loop();
        HAL_Delay(1);
    }
}

/* ==================== END OF FILE ==================== */
